Imports

In [42]:
import pandas as pd
import numpy as np
from io import StringIO
import re

Transforming Data Into Dataframe

In [43]:
data = 'Airline Code;DelayTimes;FlightCodes;To_From\nAir Canada (!);[21, 40];20015.0;WAterLoo_NEWYork\n<Air France> (12);[];;Montreal_TORONTO\n(Porter Airways. );[60, 22, 87];20035.0;CALgary_Ottawa\n12. Air France;[78, 66];;Ottawa_VANcouvER\n""".\\.Lufthansa.\\.""";[12, 33];20055.0;london_MONTreal\n'

# Convert the string to a dataframe
df = pd.read_csv(StringIO(data), sep=';')

df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []          NaN  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]          NaN  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

Task 1: FlightCodes Column

In [44]:
# Create a shifted column that is shifted forward
df['FlightCodes_shifted'] = df['FlightCodes'].shift(1)

# Add 10 to the shifted column
df['FlightCodes_shifted'] = df['FlightCodes_shifted'] + 10

# Fill the NaN values in the original column with the shifted column
df['FlightCodes'] = df['FlightCodes'].fillna(df['FlightCodes_shifted'])

# Remove the shifted column
df.drop(columns=['FlightCodes_shifted'], inplace=True)

df.head()

         Airline Code    DelayTimes  FlightCodes           To_From
0      Air Canada (!)      [21, 40]      20015.0  WAterLoo_NEWYork
1   <Air France> (12)            []      20025.0  Montreal_TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0    CALgary_Ottawa
3      12. Air France      [78, 66]      20045.0  Ottawa_VANcouvER
4   ".\.Lufthansa.\."      [12, 33]      20055.0   london_MONTreal

Alternative solution to task 1

In [ ]:
# Fill NaN values using an interpolation method
df['FlightCodes'].interpolate(method='linear', inplace=True)
df['FlightCodes'] = df['FlightCodes'].astype('int64')

Task 2: To_From Column

In [45]:
# Create new columns for the split
df[['To', 'From']] = df['To_From'].str.split('_', expand=True)

# Capital Case the columns
df['From'] = df['From'].str.upper()
df['To'] = df['To'].str.upper()

# Remove the original column
df.drop(['To_From'], axis=1, inplace=True)

df.head()

         Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada (!)      [21, 40]      20015.0  WATERLOO    NEWYORK
1   <Air France> (12)            []      20025.0  MONTREAL    TORONTO
2  (Porter Airways. )  [60, 22, 87]      20035.0   CALGARY     OTTAWA
3      12. Air France      [78, 66]      20045.0    OTTAWA  VANCOUVER
4   ".\.Lufthansa.\."      [12, 33]      20055.0    LONDON   MONTREAL

Task 3: Airline Code Column

In [46]:
# Remove any non-alphanumeric character / non-whitespace character from the Airline Code column
df['Airline Code'] = df['Airline Code'].str.replace(r'[^\w\s]', '')

df.head()

/var/folders/l4/xqbp0whj41lbslgjdm9q8xw00000gn/T/ipykernel_44843/2641596957.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Airline Code'] = df['Airline Code'].str.replace(r'[^\w\s]', '')

      Airline Code    DelayTimes  FlightCodes        To       From
0      Air Canada       [21, 40]      20015.0  WATERLOO    NEWYORK
1    Air France 12            []      20025.0  MONTREAL    TORONTO
2  Porter Airways   [60, 22, 87]      20035.0   CALGARY     OTTAWA
3    12 Air France      [78, 66]      20045.0    OTTAWA  VANCOUVER
4        Lufthansa      [12, 33]      20055.0    LONDON   MONTREAL